In [1]:
import pandas as pd
import sys
import sqlite3

In [3]:
connection = sqlite3.connect("spaceTable.db")
print("Opened database successfully")

Opened database successfully

In [4]:
cursor = connection.cursor()

In [7]:
sql_command = """CREATE TABLE space(
                                    flight_number INTEGER PRIMARY KEY,
                                    launch_date DATE,
                                    payload_mass INTEGER,
                                    orbit VARCHAR(30),
                                    organizations VARCHAR(30),
                                    mission_outcome VARCHAR(30)
                                   );"""

In [8]:
cursor.execute(sql_command)
print("Table Created Successfully")

Table Created Successfully

In [9]:
sql_command = """INSERT INTO space VALUES(104,"2019-01-19","500","LEO","ISRO","Success");"""
cursor.execute(sql_command)

In [10]:
sql_command = """INSERT INTO space VALUES(103,"2019-02-19","550","VIRGO","NASA","Success");"""
cursor.execute(sql_command)

In [11]:
sql_command = """INSERT INTO space VALUES(154,"2018-05-19","1000","GEO","ISRO","Success");"""
cursor.execute(sql_command)

In [12]:
sql_command = """INSERT INTO space VALUES(200,"2018-01-19","1500","LEO","JAXA","Success");"""
cursor.execute(sql_command)

In [13]:
connection.commit()

In [14]:
connection.close()

In [15]:
connection = sqlite3.connect("spaceTable.db")

In [16]:
cursor = connection.cursor()

In [17]:
cursor.execute("SELECT * from space ")

In [18]:
space_data = cursor.fetchall()
space_data

[(103, '2019-02-19', 550, 'VIRGO', 'NASA', 'Success'),
 (104, '2019-01-19', 500, 'LEO', 'ISRO', 'Success'),
 (154, '2018-05-19', 1000, 'GEO', 'ISRO', 'Success'),
 (200, '2018-01-19', 1500, 'LEO', 'JAXA', 'Success')]

In [19]:
space_df = pd.DataFrame(data=list(space_data),
                       columns=['flight_number','launch_date',
                                'payload_mass','orbit',
                                'organizations','mission_outcome']
                       )

In [21]:
space_df

,flight_number,launch_date,payload_mass,orbit,organizations,mission_outcome
0,103,2019-02-19,550,VIRGO,NASA,Success
1,104,2019-01-19,500,LEO,ISRO,Success
2,154,2018-05-19,1000,GEO,ISRO,Success
3,200,2018-01-19,1500,LEO,JAXA,Success

In [24]:
cursor.execute("Select * from space where organizations = 'ISRO'")

In [25]:
org_name = cursor.fetchall()

In [26]:
isro_df = pd.DataFrame(data=list(org_name),
                       columns=['flight_number','launch_date',
                                'payload_mass','orbit',
                                'organizations','mission_outcome']
                       )

In [27]:
isro_df

   flight_number launch_date  payload_mass orbit organizations mission_outcome
0            104  2019-01-19           500   LEO          ISRO         Success
1            154  2018-05-19          1000   GEO          ISRO         Success

In [28]:
cursor.execute("Select * from space where mission_outcome = 'Success'")

In [29]:
success_name = cursor.fetchall()

In [30]:
success_df = pd.DataFrame(data=list(success_name),
                       columns=['flight_number','launch_date',
                                'payload_mass','orbit',
                                'organizations','mission_outcome']
                       )

In [31]:
success_df

,flight_number,launch_date,payload_mass,orbit,organizations,mission_outcome
0,103,2019-02-19,550,VIRGO,NASA,Success
1,104,2019-01-19,500,LEO,ISRO,Success
2,154,2018-05-19,1000,GEO,ISRO,Success
3,200,2018-01-19,1500,LEO,JAXA,Success